Revit 2026 API

# FaceIntersect(Face) Method

---

Calculates the intersection of the specified face with this face and returns the intersection results.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FaceIntersectionFaceResult Intersect(
	Face face
)
```
```vb
Public Function Intersect (
	face As Face
) As FaceIntersectionFaceResult
```
```cpp
public:
FaceIntersectionFaceResult Intersect(
	Face^ face
)
```
```fsharp
member Intersect :
        face : Face -> FaceIntersectionFaceResult
```

#### Parameters

face Face
    The specified face to intersect with this face.

#### Return Value

FaceIntersectionFaceResult

  * FaceIntersectionFaceResult.Intersecting - One or more intersections were encountered.
  * SetComparisonResult.NonIntersecting - There is no intersection found.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | The face is . |
| InvalidOperationException | The intersection calculation fails. |

This is not a general-purpose function: it only works properly for simple configurations. For other configurations, it may return an incorrect result. Some configurations for which the function might return a correct result are:

  * A planar face that fully intersects another face in a single curve, when the other face is planar or cylindrical.
  * A cylindrical face that fully intersects another face in a single curve, when the other face is planar.

#### Reference

Face Class

Intersect Overload

Autodesk.Revit.DB Namespace